Repository: halisasaipulla/uyghur-library
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ug

source: Uyghur
ug: ئۇيغۇر

source: Library
ug: كۈتۈپخانىسى

source: Sign out
ug: چېكىنىش

source: Favorites
ug: ساقلېۋىلىش

source: Sign in
ug: كىرىش

source: Sign up
ug: تىزىملىتىش

source: Books
ug: كىتابلار

source: Contact Us
ug: ئالاقە قىلىڭ

source: FAQ
ug: سوئال جاۋاپ

source: Rating
ug: باھا

source: Author
ug: ئاپتور/تەرجىمان

source: Category
ug: كىتاب تۈرى

source: Summary
ug: خۇلاسە

source: Information
ug: كىتاب تەپسىلاتى

source: Reviews
ug: پىكىرلەر

source: Published Year
ug: ۋاقىت

source: Publisher
ug: نەشرىيات

source: pages
ug: بەت سانى

source: Add a comment
ug: كىتابغا باھا بېرىڭ

source: Your rating
ug: سىزنىڭ بۇ كىتابقا بەرگەن باھاڭىز

source: Submit
ug: يوللاش

source: Sign in to add comment
ug: باھا بېرىش ئالدىدا ھىسابات نومۇرىغا كىرىڭ

source: Search
ug: ئىزدەش

source: category
ug: كىتاب تۈرى

source: Back to top
ug: ئۈستىگە قايتىش

source: Name
ug: ئىسىم

source: Subject
ug: تېما

source: Message
ug: ئۇچۇر

source: Frequently Asked Questions
ug: كۆپ سورالغان سوئاللار

source: Upload
ug: ئېلكىتاب يوللاش

source: Upload Book
ug: ئېلكىتاب يوللاش

source: Log In
ug: كىرىش

source: Login
ug: كىرىش

source: Need An Account?
ug: ھېسابات لازىممۇ؟

source: Join Today
ug: بۈگۈن قوشۇلۇڭ

source: You have been logged out
ug: سىز چىقىپ كەتتىڭىز

source: Log In Again
ug: قايتا كىرىڭ

source: Return to home page
ug: باش بەتكە قايتىش

source: Already Have An Account?
ug: ھېساباتىڭىز بارمۇ؟

source: English
ug: ئىنگىلىزچە

source: Uighur
ug: ئۇيغۇرتىل

source: Korean
ug: كورېيە
